## Pandas:

üêºPandas is a tool for data processing which helps in data analysis
it provides functions and methods to efficiently manipulate large datasets

In [7]:
import pandas as pd

In [8]:
print(pd.__version__)### to check version

2.2.2

### Series create,manipulate,query,delete

In [10]:
# creating a series from a list
arr=[0,2,3,4,5,6]
s1=pd.Series(arr)
s1

0    0
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
order=[1,2,3,4,5,6]
s2=pd.Series(arr, index=order)
s2

1    0
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [12]:
import numpy as np
n=np.random.randn(5)  # create a random ndarray
index =['a','b','c','d','e']
s2=pd.Series(n,index=index)
s2

a   -0.841424
b   -1.625808
c    0.492547
d    0.886374
e    1.535047
dtype: float64

In [13]:
# crete series from dictionary
d={'a':1,'b':2,'c':3,'d':4}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
# you can modify the index of series
print(s1)
s1.index=['a','b','c','d','e','f']
s1

0    0
1    2
2    3
3    4
4    5
5    6
dtype: int64

a    0
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [15]:
# slicing
a=s1[:3]
a

a    0
b    2
c    3
dtype: int64

In [16]:
# slicing
s1[:3]

a    0
b    2
c    3
dtype: int64

In [17]:
# slicing
s1[:-1]

a    0
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
s1[2:]

c    3
d    4
e    5
f    6
dtype: int64

In [19]:
s3

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
s1

a    0
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [21]:
s4=pd.concat([s1,s3])
s4

a    0
b    2
c    3
d    4
e    5
f    6
a    1
b    2
c    3
d    4
dtype: int64

In [22]:
s4.drop('e')

a    0
b    2
c    3
d    4
f    6
a    1
b    2
c    3
d    4
dtype: int64

In [23]:
s4

a    0
b    2
c    3
d    4
e    5
f    6
a    1
b    2
c    3
d    4
dtype: int64

## Series operations

In [25]:
arr1=[2,3,4,5,6,7]
arr2=[8,9,7,4,2,3]

In [26]:
s5=pd.Series(arr2)
s5

0    8
1    9
2    7
3    4
4    2
5    3
dtype: int64

In [27]:
s6=pd.Series(arr1)
s6

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [28]:
s5.add(s6)

0    10
1    12
2    11
3     9
4     8
5    10
dtype: int64

In [29]:
s5.sub(s6)

0    6
1    6
2    3
3   -1
4   -4
5   -4
dtype: int64

In [30]:

s5.mul(s6)

0    16
1    27
2    28
3    20
4    12
5    21
dtype: int64

In [31]:
s5.div(s6)

0    4.000000
1    3.000000
2    1.750000
3    0.800000
4    0.333333
5    0.428571
dtype: float64

In [32]:
print('median',s6.median())
print('max',s6.max())
print('min',s6.min())

median 4.5
max 7
min 2

## Create Dataframe

In [34]:
dates=pd.date_range('today',periods=6)# define time sequences as index
dates

DatetimeIndex(['2025-06-22 09:54:36.848889', '2025-06-23 09:54:36.848889',
               '2025-06-24 09:54:36.848889', '2025-06-25 09:54:36.848889',
               '2025-06-26 09:54:36.848889', '2025-06-27 09:54:36.848889'],
              dtype='datetime64[ns]', freq='D')

In [35]:
dates=pd.date_range('today',periods=6)# define time sequences as index
num_arr=np.random.randn(6,4)# import numpy random array
columns=['a','b','c','d']# use the table as the column name
df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   a         b         c         d
2025-06-22 09:54:36.914664  1.541375 -0.467458  0.288495  0.128921
2025-06-23 09:54:36.914664 -1.177240 -0.782838  0.669255 -0.434595
2025-06-24 09:54:36.914664 -0.439863  1.336059 -0.548513 -0.297280
2025-06-25 09:54:36.914664  1.040842  0.419862  0.328018  0.416053
2025-06-26 09:54:36.914664 -0.092023 -1.144833  0.104327  0.656005
2025-06-27 09:54:36.914664 -2.065396 -1.390201  3.077394 -0.830623

In [36]:
# create dataframe with dictionary array
data={'animal':['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
      'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
      'visits':[1,2,3,4,4,3,5,6,1,1],
      'priority':['yes','yes','no','yes','no','yes','no','no','no','yes']}
labels=['a','b','c','d','e','f','g','h','i','j']
df2=pd.DataFrame(data,index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  NaN       4      yes
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  NaN       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

In [37]:
# see datatypes of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [38]:
df2.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  NaN       4      yes
e    dog  5.0       4       no

In [39]:
df2.tail()

  animal  age  visits priority
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  NaN       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

In [40]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [41]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 2, 'yes'],
       ['snake', 0.5, 3, 'no'],
       ['dog', nan, 4, 'yes'],
       ['dog', 5.0, 4, 'no'],
       ['cat', 2.0, 3, 'yes'],
       ['snake', 4.5, 5, 'no'],
       ['cat', nan, 6, 'no'],
       ['dog', 7.0, 1, 'no'],
       ['dog', 3.0, 1, 'yes']], dtype=object)

In [42]:
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   3.000000
std    2.007797   1.763834
min    0.500000   1.000000
25%    2.375000   1.250000
50%    3.000000   3.000000
75%    4.625000   4.000000
max    7.000000   6.000000

In [43]:
df2.T ## transpose

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    2      3    4    4    3      5    6    1    1
priority  yes  yes     no  yes   no  yes     no   no   no  yes

In [44]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       3       no
f    cat  2.0       3      yes
a    cat  2.5       1      yes
b    cat  3.0       2      yes
j    dog  3.0       1      yes
g  snake  4.5       5       no
e    dog  5.0       4       no
i    dog  7.0       1       no
d    dog  NaN       4      yes
h    cat  NaN       6       no

In [45]:
# Slicing dataframes
df2[1:3]

  animal  age  visits priority
b    cat  3.0       2      yes
c  snake  0.5       3       no

In [46]:
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f    cat  2.0       3      yes
a    cat  2.5       1      yes

In [47]:
# query dataframes by tag
df2[['age','visits']]

   age  visits
a  2.5       1
b  3.0       2
c  0.5       3
d  NaN       4
e  5.0       4
f  2.0       3
g  4.5       5
h  NaN       6
i  7.0       1
j  3.0       1

In [48]:
df2.iloc[1:3]#query rows

  animal  age  visits priority
b    cat  3.0       2      yes
c  snake  0.5       3       no

In [49]:
df3=df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  NaN       4      yes
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  NaN       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

In [50]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [52]:
df3.mean(numeric_only=True)

age       3.4375
visits    3.0000
dtype: float64

In [56]:
df3['visits'].min()

1

In [58]:
string=pd.Series(['a','b','d','aaa','nnn',np.nan,'hjk','wss','sui'])
string.str.upper()

0      A
1      B
2      D
3    AAA
4    NNN
5    NaN
6    HJK
7    WSS
8    SUI
dtype: object

## Operations for DataFrame missing values:

In [60]:
df4=df3.copy()
meanAge=df4['age'].mean()
df4.fillna(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  4.0       4      yes
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  4.0       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

In [62]:
df5=df3.copy()
df5

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  NaN       4      yes
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  NaN       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

In [64]:
df5=df3.copy()
df5.dropna

<bound method DataFrame.dropna of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
d    dog  NaN       4      yes
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
h    cat  NaN       6       no
i    dog  7.0       1       no
j    dog  3.0       1      yes>

In [66]:
df5=df3.copy()
df5.dropna(how='any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       3       no
e    dog  5.0       4       no
f    cat  2.0       3      yes
g  snake  4.5       5       no
i    dog  7.0       1       no
j    dog  3.0       1      yes

## DataFrame file operations:

In [71]:
df3.to_csv('animal.csv')

In [75]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(3)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       2      yes
2          c  snake  0.5       3       no

In [85]:
df3.to_excel('animal.xlsx',sheet_name='Sheet1')
df_animal2=pd.read_excel('animal.xlsx','Sheet1',index_col=None,na_values=['NA'])
df_animal2

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       2      yes
2          c  snake  0.5       3       no
3          d    dog  NaN       4      yes
4          e    dog  5.0       4       no
5          f    cat  2.0       3      yes
6          g  snake  4.5       5       no
7          h    cat  NaN       6       no
8          i    dog  7.0       1       no
9          j    dog  3.0       1      yes